Tekla Open API Reference for Tekla Structures 2025
Vector.Cross Method
Overload List
Name | Description
Cross(Vector)
 Returns a new cross product vector of the current vector and the given vector.
Cross(Vector, Vector)
 Returns a new cross product vector of the given two vectors.
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace